import tushare as ts
import logging


logging.basicConfig(
    level=logging.DEBUG,
    # format="[%(asctime)s] %(name)s:%(levelname)s: %(message)s"
    format="%(levelname)s: %(message)s"
)

# 1 . 获取数据
df = ts.get_hist_data('002456')  #一次性获取全部日k线数据, <class 'pandas.core.frame.DataFrame'>
# logging.debug(df)
# ts.get_hist_data('600848', ktype='W') #获取周k线数据
# ts.get_hist_data('600848', ktype='M') #获取月k线数据
# ts.get_hist_data('600848', ktype='5') #获取5分钟k线数据
# ts.get_hist_data('600848', ktype='15') #获取15分钟k线数据
# ts.get_hist_data('600848', ktype='30') #获取30分钟k线数据
# ts.get_hist_data('600848', ktype='60') #获取60分钟k线数据
# ts.get_hist_data('sh'）#获取上证指数k线数据，其它参数与个股一致，下同
# ts.get_hist_data('sz'）#获取深圳成指k线数据
# ts.get_hist_data('hs300'）#获取沪深300指数k线数据
# ts.get_hist_data('sz50'）#获取上证50指数k线数据
# ts.get_hist_data('zxb'）#获取中小板指数k线数据
# ts.get_hist_data('cyb'）#获取创业板指数k线数据

# 2. 获取个股首个上市日期，请参考以下方法：
# df = ts.get_stock_basics()
# date = df.ix['600848']['timeToMarket'] #上市日期YYYYMMDD
# ts.get_h_data('002337') #前复权
# ts.get_h_data('002337', autype='hfq') #后复权
# ts.get_h_data('002337', autype=None) #不复权
# ts.get_h_data('002337', start='2015-01-01', end='2015-03-16') #两个日期之间的前复权数据

# 3. 大盘指数的全部历史数据
ts.get_h_data('399106', index=True) #深圳综合指数

# 参数说明：
#
#     code:string,股票代码 e.g. 600848
#     start:string,开始日期 format：YYYY-MM-DD 为空时取当前日期
#     end:string,结束日期 format：YYYY-MM-DD 为空时取去年今日
#     autype:string,复权类型，qfq-前复权 hfq-后复权 None-不复权，默认为qfq
#     index:Boolean，是否是大盘指数，默认为False
#     retry_count : int, 默认3,如遇网络等问题重复执行的次数
#     pause : int, 默认 0,重复请求数据过程中暂停的秒数，防止请求间隔时间太短出现的问题
#
# 返回值说明：
#
#     date : 交易日期 (index)
#     open : 开盘价
#     high : 最高价
#     close : 收盘价
#     low : 最低价
#     volume : 成交量
#     amount : 成交金额

# 4 . 实时行情

# 一次性获取当前交易所有股票的行情数据（如果是节假日，即为上一交易日，结果显示速度取决于网速）
# ts.get_today_all()
# 返回值说明：
#
#     code：代码
#     name:名称
#     changepercent:涨跌幅
#     trade:现价
#     open:开盘价
#     high:最高价
#     low:最低价
#     settlement:昨日收盘价
#     volume:成交量
#     turnoverratio:换手率

# 5 . 历史分笔
#
# 获取个股以往交易历史的分笔数据明细，通过分析分笔数据，可以大致判断资金的进出情况。在使用过程中，对于获取股票某一阶段的历史分笔数据，需要通过参入交易日参数并append到一个DataFrame或者直接append到本地同一个文件里。历史分笔接口只能获取当前交易日之前的数据，当日分笔历史数据请调用get_today_ticks()接口或者在当日18点后通过本接口获取。
#
# 参数说明：
#
#     code：股票代码，即6位数字代码
#     date：日期，格式YYYY-MM-DD
#     retry_count : int, 默认3,如遇网络等问题重复执行的次数
#     pause : int, 默认 0,重复请求数据过程中暂停的秒数，防止请求间隔时间太短出现的问题
#
# 调用方法：
#
# import tushare as ts
#
# df = ts.get_tick_data('600848',date='2014-01-09')
# df.head(10)
#
# 返回值说明：
#
#     time：时间
#     price：成交价格
#     change：价格变动
#     volume：成交手
#     amount：成交金额(元)
#     type：买卖类型【买盘、卖盘、中性盘】


# 实时分笔
#
# 获取实时分笔数据，可以实时取得股票当前报价和成交信息，其中一种场景是，写一个python定时程序来调用本接口（可两三秒执行一次，性能与行情软件基本一致），然后通过DataFrame的矩阵计算实现交易监控，可实时监测交易量和价格的变化。
#
# 参数说明：
#
#     symbols：6位数字股票代码，或者指数代码（sh=上证指数 sz=深圳成指 hs300=沪深300指数 sz50=上证50 zxb=中小板 cyb=创业板） 可输入的类型：str、list、set或者pandas的Series对象
#
# 调用方法：
#
# import tushare as ts
#
# df = ts.get_realtime_quotes('000581') #Single stock symbol
# df[['code','name','price','bid','ask','volume','amount','time']]
#
# 结果显示：
#
#    code    name     price  bid    ask    volume   amount        time
# 0  000581  威孚高科  31.15  31.14  31.15  8183020  253494991.16  11:30:36
#
# 返回值说明：
#
# 0：name，股票名字
# 1：open，今日开盘价
# 2：pre_close，昨日收盘价
# 3：price，当前价格
# 4：high，今日最高价
# 5：low，今日最低价
# 6：bid，竞买价，即“买一”报价
# 7：ask，竞卖价，即“卖一”报价
# 8：volume，成交量 maybe you need do volume/100
# 9：amount，成交金额（元 CNY）
# 10：b1_v，委买一（笔数 bid volume）
# 11：b1_p，委买一（价格 bid price）
# 12：b2_v，“买二”
# 13：b2_p，“买二”
# 14：b3_v，“买三”
# 15：b3_p，“买三”
# 16：b4_v，“买四”
# 17：b4_p，“买四”
# 18：b5_v，“买五”
# 19：b5_p，“买五”
# 20：a1_v，委卖一（笔数 ask volume）
# 21：a1_p，委卖一（价格 ask price）
# ...
# 30：date，日期；
# 31：time，时间；
#
# 请求多个股票方法（一次最好不要超过30个）：
#
# #symbols from a list
# ts.get_realtime_quotes(['600848','000980','000981'])
# #from a Series
# ts.get_realtime_quotes(df['code'].tail(10))  #一次获取10个股票的实时分笔数据
#
# 获取实时指数：
#
# #上证指数
# ts.get_realtime_quotes('sh')
# #上证指数 深圳成指 沪深300指数 上证50 中小板 创业板
# ts.get_realtime_quotes(['sh','sz','hs300','sz50','zxb','cyb'])
# #或者混搭
# ts.get_realtime_quotes(['sh','600848'])
#
# 当日历史分笔
#
# 获取当前交易日（交易进行中使用）已经产生的分笔明细数据。
#
# 参数说明：
#
#     code：股票代码，即6位数字代码
#     retry_count : int, 默认3,如遇网络等问题重复执行的次数
#     pause : int, 默认 0,重复请求数据过程中暂停的秒数，防止请求间隔时间太短出现的问题
#
# 调用方法：
#
# import tushare as ts
#
# df = ts.get_today_ticks('601333')
# df.head(10)
#
# 返回值说明：
#
#     time：时间
#     price：当前价格
#     pchange:涨跌幅
#     change：价格变动
#     volume：成交手
#     amount：成交金额(元)
#     type：买卖类型【买盘、卖盘、中性盘】
#
# 结果显示：
#
#         time     price pchange  change  volume   amount type
# 0     11:30:07   5.77   -0.52    0.00     634   366372   买盘
# 1     11:29:57   5.77   -0.52    0.00     216   124632   买盘
# 2     11:29:52   5.77   -0.52    0.00     306   176562   买盘
# 3     11:29:42   5.77   -0.52    0.01     159    91766   买盘
# 4     11:29:37   5.76   -0.69    0.00     546   314496   卖盘
# 5     11:29:32   5.76   -0.69   -0.01     954   549504   卖盘
# 6     11:29:22   5.77   -0.52    0.00     374   215798   买盘
# 7     11:29:17   5.77   -0.52    0.00     762   439674   买盘
# 8     11:29:12   5.77   -0.52    0.00     164    95182   买盘
# 9     11:29:07   5.77   -0.52    0.00     303   174854   买盘
#
# 大盘指数行情列表
#
# 获取大盘指数实时行情列表，以表格的形式展示大盘指数实时行情。
#
# 调用方法：
#
# import tushare as ts
#
# df = ts.get_index()
#
# 返回值说明：
#
#     code:指数代码
#     name:指数名称
#     change:涨跌幅
#     open:开盘点位
#     preclose:昨日收盘点位
#     close:收盘点位
#     high:最高点位
#     low:最低点位
#     volume:成交量(手)
#     amount:成交金额（亿元）
#
# 结果显示：
#
#     code        name    change   preclose      close       high        low  \
# 0   000001    上证指数  -1.13   4527.396   4476.215   4572.391   4432.904
# 1   000002    Ａ股指数  -1.13   4744.093   4690.628   4791.534   4645.190
# 2   000003    Ｂ股指数  -2.15    403.694    395.018    405.795    392.173
# 3   000008    综合指数   0.79   3724.496   3753.906   3848.575   3695.817
# 4   000009   上证380  -2.79   7689.128   7474.305   7695.329   7398.911
# 5   000010   上证180  -1.13  10741.180  10619.610  10863.080  10529.900
# 6   000011    基金指数  -1.02   7033.291   6961.659   7058.856   6918.273
# 7   000012    国债指数   0.01    148.626    148.641    148.656    148.510
# 8   000016    上证50  -0.79   3308.454   3282.330   3370.025   3255.769
# 9   000017     新综指  -1.13   3826.013   3782.936   3864.307   3746.284
# 10  000300   沪深300  -1.37   4807.592   4741.861   4839.078   4703.567
# 11  399001    深证成指  -0.69  14809.424  14707.245  14979.810  14580.422
# 12  399002    深成指R  -0.69  17193.832  17075.202  17391.652  16927.959
# 13  399003    成份Ｂ指  -1.93   9027.079   8853.081   9013.194   8826.048
# 14  399004  深证100R  -1.79   5994.881   5887.414   6036.322   5832.431
# 15  399005    中小板指  -3.34   8935.338   8637.195   8953.813   8551.202
# 16  399006    创业板指  -2.17   2747.497   2687.974   2779.200   2650.425
# 17  399100   新 指 数  -2.77  10091.194   9811.256  10111.664   9718.085
# 18  399101    中小板综  -3.31  12792.057  12368.868  12800.453  12253.744
# 19  399106    深证综指  -2.76   2271.275   2208.561   2275.344   2187.897
# 20  399107    深证Ａ指  -2.77   2375.176   2309.466   2379.507   2287.784
# 21  399108    深证Ｂ指  -1.77   1398.244   1373.512   1397.996   1367.343
# 22  399333    中小板R  -3.34   9640.766   9319.085   9660.699   9226.304
# 23  399606    创业板R  -2.16   2828.251   2767.127   2861.040   2728.472
#
#
#         volume    amount
# 0     767676416  10611.72
# 1     766188823  10599.65
# 2       1487592     12.07
# 3     263748855   3440.01
# 4     182628996   2531.04
# 5     464275133   6437.40
# 6      66280981    428.46
# 7        263420      2.74
# 8     266042859   3735.74
# 9     766077611  10596.65
# 10    608638545   8603.50
# 11  51106975785   6405.28
# 12   6357969430   1017.68
# 13     51206484      4.32
# 14  10418315890   1779.58
# 15   3071396395    830.54
# 16   1441659735    551.73
# 17  32943457787   6091.34
# 18  10450911278   2291.43
# 19  33395285515   6137.71
# 20  33274363870   6128.94
# 21    120921645      8.77
# 22   3071396395    830.54
# 23   1441659735    551.73
#
# 大单交易数据
#
# 获取大单交易数据，默认为大于等于400手，数据来源于新浪财经。
#
# 参数说明：
#
#     code：股票代码，即6位数字代码
#     date:日期，格式YYYY-MM-DD
#     vol:手数，默认为400手，输入数值型参数
#     retry_count : int, 默认3,如遇网络等问题重复执行的次数
#     pause : int, 默认 0,重复请求数据过程中暂停的秒数，防止请求间隔时间太短出现的问题
#
# 返回值说明：
#
#     code：代码
#     name：名称
#     time：时间
#     price：当前价格
#     volume：成交手
#     preprice ：上一笔价格
#     type：买卖类型【买盘、卖盘、中性盘】
#
# 调用方法：
#
# import tushare as ts
#
# df = ts.get_sina_dd('600848', date='2015-12-24') #默认400手
#df = ts.get_sina_dd('600848', date='2015-12-24', vol=500)  #指定大于等于500手的数据



